app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-15 01:06:13.581913"], ["text", "aasdfa"], ["title", "this is a title"], ["updated_at", "2015-03-15 01:06:13.581913"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save